package NamesGenerator;

import java.util.Random;

public class FirstName {

    private String firstName;
    private boolean isMaleName;

    private static final String[] MALE_NAMES = {
            "Аким", "Александр", "Алексей", "Анатолий", "Андрей", "Антон", "Анфим", "Аркадий", "Арсений", "Артём", "Артемий",
            "Богдан", "Борис", "Борислав",
            "Вадим", "Валентин", "Валерий", "Василий", "Виктор", "Виталий", "Владимир", "Владислав", "Владлен", "Влас", "Всеволод", "Вячеслав",
            "Гавриил", "Геннадий", "Георгий", "Герасим", "Глеб", "Гордей", "Григорий",
            "Дамир", "Даниил", "Данислав", "Демид", "Демьян", "Денис", "Джереми", "Дмитрий",
            "Евгений", "Евдоким", "Евстахий", "Егор", "Елисей", "Емельян", "Еремей", "Ефим",
            "Евгения", "Евдокия", "Екатерина", "Елена", "Елизавета", "Есения",
            "Захар", "Захар",
            "Иван", "Игнат", "Игнатий", "Игорь", "Иероним", "Илья", "Иннокентий",
            "Кирилл", "Клим", "Константин", "Кузьма",
            "Лев", "Леонид",
            "Макар", "Макарий", "Максим", "Марк", "Мартын", "Матвей", "Мирослав", "Михаил",
            "Никита", "Никодим", "Никола", "Николай",
            "Олег", "Осип", "Остап",
            "Пётр", "Павел", "Платон", "Потап", "Прохор",
            "Радий", "Радик", "Радомир", "Радослав", "Ринат", "Родион", "Роман", "Ростислав", "Руслан",
            "Савелий", "Святослав", "Севастьян", "Семён", "Сергей", "Сидор", "Спартак", "Станислав", "Степан",
            "Тарас", "Тимофей", "Тихон", "Трофим",
            "Фёдор", "Федот", "Филипп", "Флор", "Фома",
            "Харитон",
            "Юлиан", "Юрий",
            "Яков", "Ярослав"
    };

    private static final String[] FEMALE_NAMES = {
            "Авдотья", "Агафья", "Аида", "Аксинья", "Алёна", "Алевтина", "Александра", "Алина", "Алла", "Анастасия",
            "Ангелина", "Анисья", "Анна",  "Антонина", "Анфиса", "Аполлинария", "Арина", "Ася", "Аэлита",
            "Богдана",
            "Валентина", "Валерия", "Варвара", "Василина", "Василиса", "Венера", "Вера", "Вета", "Викторина", "Виктория",
            "Вилена", "Виталина", "Влада", "Владана", "Владислава",
            "Галина", "Глафира",
            "Дарья", "Дина", "Домника",
            "Зинаида", "Злата", "Зоя",
            "Изабелла", "Илина", "Иллирика", "Инесса", "Инна", "Иоанна", "Ира", "Ираида", "Ирина",
            "Карина", "Кира", "Кристина", "Ксения",
            "Лада", "Лара", "Лариса", "Лера", "Лидия", "Лика", "Лина", "Лукерья", "Любовь", "Людмила", "Ляля",
            "Магдалeна", "Майя", "Макария", "Маргарита", "Марина", "Мария", "Марфа", "Мила", "Милада",
            "Милана", "Милена", "Милица", "Мира", "Мирослава", "Мирра",
            "Надежда", "Наталья", "Нелли", "Ника", "Нина", "Нинель",
            "Оксана", "Октябрина", "Олеся", "Ольга",
            "Павлина", "Пелагея", "Платонида", "Полина", "Прасковья",
            "Рада", "Раиса", "Рената", "Римма", "Русалина", "Руслана",
            "Сабина", "Светлана", "Серафима", "Соня", "Софья", "Стелла",
            "Таисия","Татьяна", "Таяна",
            "Ульяна", "Устинья",
            "Фаина",
            "Цагана", "Цветана",
            "Юлия", "Юния",
            "Яна", "Янина", "Ярина", "Ярослава"
    };

    public FirstName(){

    }

    public String getFirstName() {

        double random = Math.random();

        if ((int) Math.round(random) == 1){
            int maleItem = new Random().nextInt(MALE_NAMES.length);
            this.firstName = MALE_NAMES[maleItem];
            this.isMaleName = true;
        }
        else {
            int femaleItem = new Random().nextInt(FEMALE_NAMES.length);
            this.firstName = FEMALE_NAMES[femaleItem];
            this.isMaleName = false;
        }

        return firstName;
    }

    public boolean isMaleName(){
        return this.isMaleName;
    }
}